app/controllers/pins_controller.rb

INSERT INTO "pins" ("photo", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @pin = Pin.new(pin_params)
    @pin.user_id = current_user.id

    respond_to do |format|
      if @pin.save

UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["description", "Because it never removes its skull helmet, no one has ever seen this Pokémon's real face."], ["updated_at", "2018-08-01 19:51:10.851918"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @pin.update(pin_params)

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_pin
      @pin = Pin.find(params[:id])